Import da biblioteca pandas

In [1]:
import pandas as pd

Import do arquivo nomes.csv à partir da pasta do exercício anterior

In [2]:
df = pd.read_csv('../1-aws_s3/dados/nomes.csv')

Dimensão do dataset "names"

In [3]:
df.shape
print(f'O dataset possui {df.shape[0]} linhas e {df.shape[1]} colunas.')

O dataset possui 1825433 linhas e 4 colunas.

Colunas do dataset "names"

In [4]:
df.columns

Index(['nome', 'sexo', 'total', 'ano'], dtype='object')

Tipos dos dados no dataset "names"

In [5]:
df.dtypes

nome     object
sexo     object
total     int64
ano       int64
dtype: object

In [6]:
df.head()

       nome sexo  total   ano
0  Jennifer    F  54336  1983
1   Jessica    F  45278  1983
2    Amanda    F  33752  1983
3    Ashley    F  33292  1983
4     Sarah    F  27228  1983